In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as  plot

data = pd.read_csv("../../data/Salary_Dataset_with_Extra_Features.csv")
data.head(2)

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android

### make a company anaiys

get data

In [7]:
def company_deatils(name : str):
  company_data  =  data[data["Company Name"].str.lower() == name.lower()]

  #company_level
  dashboard_data = {
    "overall_rating" : np.mean(company_data["Rating"]),
    "Jobs_role" : list(np.unique(company_data["Job Title"])),
    "Jobs_status" : list(np.unique(company_data["Employment Status"])),
    "Company_location" : list(np.unique(company_data["Location"]))
  }

  #roles level

  roles_emp_status = company_data.groupby(by=["Job Title", "Employment Status"]).agg({
    "Salary" : "mean",
    
  }).reset_index()

  roles_location = company_data.groupby(by=["Job Title", "Employment Status", "Location"]).agg({
    "Salary" : "mean",
    # "Salaries Reported" : "sum",
  }).reset_index()

  #max salary
  max_emp_status = company_data.groupby(by=["Job Title", "Employment Status"]).agg({
    "Salary" : "max",
  }).reset_index()

  #min salary
  min_emp_status = company_data.groupby(by=["Job Title", "Employment Status"]).agg({
    "Salary" : "min",
  }).reset_index()



  return dashboard_data, roles_location, roles_emp_status, max_emp_status, min_emp_status



dashboard_data, roles_location, roles_emp_status, max_emp_status, min_emp_status  = company_deatils("Amazon")
dashboard_data

{'overall_rating': 3.8,
 'Jobs_role': ['Amazon Software Development Engineer',
  'Amazon Software Development Engineer - Intern',
  'Amazon Software Development Engineer I',
  'Amazon Software Development Engineer II',
  'Amazon Software Development Engineer In Test',
  'Android Developer',
  'Android Developer - Intern',
  'Android Software Engineer',
  'Backend Developer',
  'Backend Engineer',
  'Database Administrator',
  'Database Administrator (Database Administrator)',
  'Database Architect',
  'Front End Developer',
  'Front End Developer - Intern',
  'Front End Engineer',
  'Front End Engineer II',
  'Front-End Developer',
  'Java Software Developer',
  'Java Software Engineer',
  'Junior Java Developer',
  'Python Developer',
  'SDE-2 Backend',
  'Senior IOS Engineer',
  'Senior Software Development Engineer',
  'Senior Software Development Engineer - Intern',
  'Software Development Engineer',
  'Software Development Engineer (SDE)',
  'Software Development Engineer (SDE) - Contractor',
  'Software Development Engineer (SDE) - Intern',
  'Software Development Engineer (SDE) I',
  'Software Development Engineer (SDE) II',
  'Software Development Engineer (SDE) III',
  'Software Development Engineer (SDE1)',
  'Software Development Engineer (SDE1) - Intern',
  'Software Development Engineer - Contractor',
  'Software Development Engineer - II',
  'Software Development Engineer - Intern',
  'Software Development Engineer I',
  'Software Development Engineer I - Intern',
  'Software Development Engineer II',
  'Software Development Engineer III',
  'Software Development Engineer In Test',
  'Software Development Engineer In Test (SDET)',
  'Software Development Engineer In Test (SDET) - Intern',
  'Software Development Engineer In Test (SDET) I',
  'Software Development Engineer In Test (SDET) II',
  'Software Development Engineer In Test (SDET) II - Contractor',
  'Software Development Engineer In Test - Intern',
  'Software Development Engineer In Test I',
  'Software Development Engineer In Test II',
  'Software Development Engineer(II Months) - Intern',
  'Software Development Engineer(SDE)',
  'Software Development Engineer(SDE) - Intern',
  'Software Development Engineer, Test - Intern',
  'Software Development Engineer-1',
  'Software Development Engineer-1 - Intern',
  'Software Development Engineer-I',
  'Software Development Engineer-II',
  'Software Development Enginner-||',
  'Software Development Test Engineer',
  'Software Engineer - Java Developer',
  'Sr Software Development Engineer',
  'Test Engineer',
  'Tester',
  'Web Developer',
  'Web Developer - Intern'],
 'Jobs_status': ['Contractor', 'Full Time', 'Intern'],
 'Company_location': ['Bangalore',
  'Chennai',
  'Hyderabad',
  'Jaipur',
  'Kolkata',
  'Madhya Pradesh',
  'Mumbai',
  'New Delhi',
  'Pune']}

In [8]:
max_emp_status

                                        Job Title Employment Status   Salary
0            Amazon Software Development Engineer         Full Time  1150000
1   Amazon Software Development Engineer - Intern            Intern   800000
2          Amazon Software Development Engineer I         Full Time  1300000
3         Amazon Software Development Engineer II         Full Time  2800000
4    Amazon Software Development Engineer In Test         Full Time   204000
..                                            ...               ...      ...
62               Sr Software Development Engineer         Full Time  5600000
63                                  Test Engineer         Full Time   400000
64                                         Tester         Full Time   500000
65                                  Web Developer         Full Time   100000
66                         Web Developer - Intern            Intern   552000

[67 rows x 3 columns]

In [9]:
roles_location

,Job Title,Employment Status,Location,Salary
0,Amazon Software Development Engineer,Full Time,Bangalore,200000.0
1,Amazon Software Development Engineer,Full Time,Chennai,200000.0
2,Amazon Software Development Engineer,Full Time,Hyderabad,300000.0
3,Amazon Software Development Engineer,Full Time,Kolkata,1150000.0
4,Amazon Software Development Engineer,Full Time,Mumbai,240000.0
...,...,...,...,...
150,Test Engineer,Full Time,Bangalore,300000.0
151,Test Engineer,Full Time,Hyderabad,400000.0
152,Tester,Full Time,Hyderabad,500000.0
153,Web Developer,Full Time,Bangalore,100000.0
154,Web Developer - Intern,Intern,Bangalore,552000.0

In [10]:
roles_emp_status

,Job Title,Employment Status,Salary
0,Amazon Software Development Engineer,Full Time,4.128571e+05
1,Amazon Software Development Engineer - Intern,Intern,6.290000e+05
2,Amazon Software Development Engineer I,Full Time,1.300000e+06
3,Amazon Software Development Engineer II,Full Time,2.800000e+06
4,Amazon Software Development Engineer In Test,Full Time,2.040000e+05
...,...,...,...
62,Sr Software Development Engineer,Full Time,5.600000e+06
63,Test Engineer,Full Time,3.500000e+05
64,Tester,Full Time,5.000000e+05
65,Web Developer,Full Time,1.000000e+05
66,Web Developer - Intern,Intern,5.520000e+05

In [11]:
from matplotlib.pyplot import bar, xlabel, ylabel, title

graph = roles_emp_status[roles_emp_status["Employment Status"] == "Full Time"].drop(columns=["Salaries Reported","Employment Status"])

bar(graph["Job Roles"], graph["Salary"])
xlabel('Employment Status');
ylabel('Salary (USD)');
title('Salary by Employment Status');

KeyError: "['Salaries Reported'] not found in axis"

In [15]:
graph

   Job Roles        Salary
0    Android  7.630000e+05
2    Backend  2.495333e+06
3   Database  2.066667e+06
4   Frontend  1.648000e+06
6        IOS  2.400000e+06
7       Java  6.140000e+05
8     Python  5.040000e+05
10       SDE  1.302078e+06
12   Testing  4.000000e+05
13       Web  1.000000e+05

In [12]:
max_emp_status

                                        Job Title Employment Status   Salary
0            Amazon Software Development Engineer         Full Time  1150000
1   Amazon Software Development Engineer - Intern            Intern   800000
2          Amazon Software Development Engineer I         Full Time  1300000
3         Amazon Software Development Engineer II         Full Time  2800000
4    Amazon Software Development Engineer In Test         Full Time   204000
..                                            ...               ...      ...
62               Sr Software Development Engineer         Full Time  5600000
63                                  Test Engineer         Full Time   400000
64                                         Tester         Full Time   500000
65                                  Web Developer         Full Time   100000
66                         Web Developer - Intern            Intern   552000

[67 rows x 3 columns]

In [13]:
min_emp_status

   Job Roles Employment Status   Salary
0    Android         Full Time   228000
1    Android            Intern   984000
2    Backend         Full Time   672000
3   Database         Full Time   700000
4   Frontend         Full Time   240000
5   Frontend            Intern   120000
6        IOS         Full Time  2400000
7       Java         Full Time   456000
8     Python         Full Time   504000
9        SDE        Contractor   100000
10       SDE         Full Time    33792
11       SDE            Intern   100000
12   Testing         Full Time   300000
13       Web         Full Time   100000
14       Web            Intern   552000